In [1]:
people = {
    "first": ["Correy", "Sherry", "Kevin"],
    "second": ["Nendi", "Kentin", "Marigat"],
}

In [2]:
people["first"]

['Correy', 'Sherry', 'Kevin']

In [3]:
people["first"][0]

'Correy'

In [4]:
people["first"][-1]

'Kevin'

In [5]:
import pandas as pd

In [6]:
dictionaries_df=pd.DataFrame(people)

In [7]:
dictionaries_df

    first   second
0  Correy    Nendi
1  Sherry   Kentin
2   Kevin  Marigat

In [10]:
#Accessing a single column
dictionaries_df["first"]

0    Correy
1    Sherry
2     Kevin
Name: first, dtype: object

In [11]:
#checking type of the column
type(dictionaries_df["first"])

pandas.core.series.Series

In [12]:
#A series is a one dimensional data structure. Meaning its rows of a single column and many series make up a dataframe

In [13]:
#Accessing multiple columns
#Pass the names of the columns as a list
dictionaries_df[["first","second"]]

    first   second
0  Correy    Nendi
1  Sherry   Kentin
2   Kevin  Marigat

In [14]:
#If we want to know all the columns and get them, we can use the columns attribute
dictionaries_df.columns

Index(['first', 'second'], dtype='object')

In [18]:
#To access rows we can use the loc and iloc 
#iloc allows use to access the row using integer notation hence the name
#Returns a series that contains the values of the selected row of the dataframe
#An example accessing the second row, indexed 1  using iloc
#The column names are the index of the series
dictionaries_df.iloc[1]

first     Sherry
second    Kentin
Name: 1, dtype: object

In [19]:
#Accesing multiple rows using iloc
#This returns a dataframe 

dictionaries_df.iloc[[0,2]]

    first   second
0  Correy    Nendi
2   Kevin  Marigat

In [20]:
#selecting columns using iloc
dictionaries_df.iloc[[0,1],0]

0    Correy
1    Sherry
Name: first, dtype: object

In [21]:
#using loac, loc uses labels
#for our current dataset, the labels are the indexes
#selecting rows using loc
dictionaries_df.loc[[0,1]]

    first  second
0  Correy   Nendi
1  Sherry  Kentin

In [22]:
#selecting rows and columns using loc
#The difference between loc and iloc is that in iloc we were passing the index of the column and in loc we wiill have to use the labels
dictionaries_df.loc[[0,1], "second"]

0     Nendi
1    Kentin
Name: second, dtype: object

In [27]:
#We can also select multiple rows and columns using loc
#Both the rows and columns will be in inner lists
dictionaries_df.loc[[0,1],["first","second"]]

    first  second
0  Correy   Nendi
1  Sherry  Kentin